## Terraform Plan

**Image:** `239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/dsp-agent:52b0419`

<details>
<summary>Show Plan</summary>

```
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_ecr_repository.agent: Refreshing state... [id=iker-agents/dsp-agent]
aws_cognito_user_pool.main[0]: Refreshing state... [id=us-east-1_0Och8G0S2]
data.aws_caller_identity.current: Read complete after 0s [id=239388734812]
aws_ecr_lifecycle_policy.agent: Refreshing state... [id=iker-agents/dsp-agent]
module.dsp_agent.data.aws_iam_policy_document.bedrock_invoke: Reading...
module.dsp_agent.data.aws_region.current: Reading...
module.dsp_agent.data.aws_iam_policy_document.runtime_assume_role: Reading...
module.dsp_agent.data.aws_iam_policy_document.cloudwatch_logs: Reading...
module.dsp_agent.data.aws_iam_policy_document.ecr_pull: Reading...
module.dsp_agent.aws_bedrockagentcore_memory.this: Refreshing state... [id=dsp_agent_tf_memory-lRHahyCGis]
module.dsp_agent.data.aws_iam_policy_document.xray: Reading...
module.dsp_agent.data.aws_iam_policy_document.bedrock_invoke: Read complete after 0s [id=1713947774]
module.dsp_agent.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.dsp_agent.data.aws_caller_identity.current: Reading...
module.dsp_agent.data.aws_iam_policy_document.cloudwatch_logs: Read complete after 0s [id=3253318109]
module.dsp_agent.data.aws_iam_policy_document.ecr_pull: Read complete after 0s [id=3988369881]
module.dsp_agent.data.aws_iam_policy_document.xray: Read complete after 0s [id=1756567564]
module.dsp_agent.data.aws_iam_policy_document.runtime_assume_role: Read complete after 0s [id=4217861921]
module.dsp_agent.aws_iam_role.runtime: Refreshing state... [id=dsp-agent-tf-runtime-role]
module.dsp_agent.data.aws_caller_identity.current: Read complete after 0s [id=239388734812]
module.dsp_agent.data.aws_iam_policy_document.lambda_invoke: Reading...
module.dsp_agent.data.aws_iam_policy_document.lambda_invoke: Read complete after 0s [id=2150515099]
aws_cognito_user_pool_domain.main[0]: Refreshing state... [id=agent-ui-tf-239388734812]
aws_cognito_user_pool_client.main[0]: Refreshing state... [id=km1gk1jcpoud4j029bverljba]
module.dsp_agent.data.aws_iam_policy_document.memory_access: Reading...
module.dsp_agent.data.aws_iam_policy_document.memory_access: Read complete after 0s [id=479195913]
module.dsp_agent.aws_iam_role_policy.memory_access: Refreshing state... [id=dsp-agent-tf-runtime-role:memory-access]
module.dsp_agent.aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=dsp-agent-tf-runtime-role:cloudwatch-logs]
module.dsp_agent.aws_iam_role_policy.lambda_invoke: Refreshing state... [id=dsp-agent-tf-runtime-role:lambda-invoke]
module.dsp_agent.aws_iam_role_policy.ecr_pull: Refreshing state... [id=dsp-agent-tf-runtime-role:ecr-pull]
module.dsp_agent.aws_iam_role_policy.bedrock_invoke: Refreshing state... [id=dsp-agent-tf-runtime-role:bedrock-invoke]
module.dsp_agent.aws_iam_role_policy.xray: Refreshing state... [id=dsp-agent-tf-runtime-role:xray-tracing]
module.dsp_agent.aws_bedrockagentcore_agent_runtime.this: Refreshing state...
module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["prod"]: Refreshing state... [name=prod]
module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["canary"]: Refreshing state... [name=canary]
module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["dev"]: Refreshing state... [name=dev]
module.ui[0].aws_iam_role.lambda: Refreshing state... [id=agent-ui-tf-lambda-role]
module.ui[0].aws_s3_bucket.ui: Refreshing state... [id=agent-ui-tf-239388734812]
module.ui[0].aws_iam_role_policy.lambda_logs: Refreshing state... [id=agent-ui-tf-lambda-role:lambda-logs]
module.ui[0].aws_iam_role_policy.lambda_agentcore: Refreshing state... [id=agent-ui-tf-lambda-role:agentcore-invoke]
module.ui[0].aws_lambda_function.proxy: Refreshing state... [id=agent-ui-tf-proxy]
module.ui[0].aws_s3_bucket_public_access_block.ui: Refreshing state... [id=agent-ui-tf-239388734812]
module.ui[0].aws_s3_bucket_website_configuration.ui: Refreshing state... [id=agent-ui-tf-239388734812]
module.ui[0].aws_s3_bucket_policy.ui: Refreshing state... [id=agent-ui-tf-239388734812]
module.ui[0].aws_cloudfront_distribution.ui: Refreshing state... [id=E1N79FYP07LOK]
module.ui[0].aws_apigatewayv2_api.api: Refreshing state... [id=t042pm32d2]
module.ui[0].aws_lambda_permission.api: Refreshing state... [id=AllowAPIGateway]
module.ui[0].aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.ui[0].aws_apigatewayv2_integration.lambda: Refreshing state... [id=6q0hy02]
module.ui[0].aws_apigatewayv2_authorizer.jwt[0]: Refreshing state... [id=twa4ac]
module.ui[0].aws_apigatewayv2_route.agents: Refreshing state... [id=sfe4rqh]
module.ui[0].aws_apigatewayv2_route.invoke: Refreshing state... [id=biyutvd]
null_resource.update_cognito_callbacks[0]: Refreshing state... [id=5822675665405264724]
module.gateway[0].aws_iam_role.mcp_lambda: Refreshing state... [id=agentcore-mcp-lambda-role]
module.gateway[0].aws_iam_role.gateway: Refreshing state... [id=agentcore-mcp-gateway-role]
module.gateway[0].aws_iam_role_policy.mcp_lambda_logs: Refreshing state... [id=agentcore-mcp-lambda-role:lambda-logs]
module.gateway[0].aws_lambda_function.mcp_server: Refreshing state... [id=agentcore-mcp-mcp-server]
module.gateway[0].aws_bedrockagentcore_gateway.mcp: Refreshing state... [name=agentcore-mcp-gateway]
module.gateway[0].aws_iam_role_policy.gateway_lambda: Refreshing state... [id=agentcore-mcp-gateway-role:lambda-invoke]
module.gateway[0].aws_lambda_permission.gateway: Refreshing state... [id=AllowGateway]
module.gateway[0].aws_bedrockagentcore_gateway_target.get_customer: Refreshing state... [name=agentcore-mcp-get-customer]
module.gateway[0].aws_bedrockagentcore_gateway_target.list_customers: Refreshing state... [name=agentcore-mcp-list-customers]
module.gateway[0].aws_bedrockagentcore_gateway_target.get_analytics: Refreshing state... [name=agentcore-mcp-get-analytics]
module.gateway[0].aws_bedrockagentcore_gateway_target.list_orders: Refreshing state... [name=agentcore-mcp-list-orders]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dsp_agent.aws_bedrockagentcore_agent_runtime.this will be updated in-place
  ~ resource "aws_bedrockagentcore_agent_runtime" "this" {
      ~ agent_runtime_version     = "14" -> (known after apply)
        tags                      = {
            "Agent"     = "dsp-agent-tf"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (10 unchanged attributes hidden)

      ~ agent_runtime_artifact {
          ~ container_configuration {
              ~ container_uri = "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/dsp-agent:latest" -> "239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/dsp-agent:52b0419"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.gateway[0].data.archive_file.mcp_lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "mcp_lambda" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/gateway/mcp_lambda.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                import json
                from datetime import datetime, timedelta
                
                # Mock Data Store
                MOCK_CUSTOMERS = {
                    "cust-001": {"id": "cust-001", "name": "Acme Corporation", "email": "contact@acme.com", "tier": "enterprise", "balance": 15000.00},
                    "cust-002": {"id": "cust-002", "name": "TechStart Inc", "email": "hello@techstart.io", "tier": "growth", "balance": 3500.00},
                    "cust-003": {"id": "cust-003", "name": "DataFlow Labs", "email": "info@dataflow.dev", "tier": "starter", "balance": 750.00}
                }
                
                MOCK_ORDERS = {
                    "ord-001": {"id": "ord-001", "customer_id": "cust-001", "items": [{"name": "Enterprise License", "quantity": 1, "price": 10000.00}], "status": "completed", "created_at": "2024-01-10"},
                    "ord-002": {"id": "ord-002", "customer_id": "cust-002", "items": [{"name": "Growth License", "quantity": 1, "price": 3000.00}], "status": "pending", "created_at": "2024-01-25"},
                    "ord-003": {"id": "ord-003", "customer_id": "cust-001", "items": [{"name": "Add-on Module", "quantity": 3, "price": 500.00}], "status": "processing", "created_at": "2024-01-28"}
                }
                
                MOCK_ANALYTICS = {"daily_active_users": 1250, "monthly_revenue": 45000.00, "churn_rate": 0.02, "nps_score": 72, "support_tickets_open": 15}
                
                def get_tools_list():
                    return {
                        "tools": [
                            {"name": "get_customer", "description": "Get customer details by ID", "inputSchema": {"type": "object", "properties": {"customer_id": {"type": "string", "description": "Customer ID"}}, "required": ["customer_id"]}},
                            {"name": "list_customers", "description": "List all customers, optionally filtered by tier", "inputSchema": {"type": "object", "properties": {"tier": {"type": "string", "description": "Filter by tier"}}}},
                            {"name": "search_customers", "description": "Search customers by name or email", "inputSchema": {"type": "object", "properties": {"query": {"type": "string", "description": "Search query"}}, "required": ["query"]}},
                            {"name": "get_order", "description": "Get order details by ID", "inputSchema": {"type": "object", "properties": {"order_id": {"type": "string", "description": "Order ID"}}, "required": ["order_id"]}},
                            {"name": "list_orders", "description": "List orders, optionally filtered", "inputSchema": {"type": "object", "properties": {"customer_id": {"type": "string"}, "status": {"type": "string"}}}},
                            {"name": "get_analytics", "description": "Get business analytics and KPIs", "inputSchema": {"type": "object", "properties": {}}},
                            {"name": "get_revenue_forecast", "description": "Get revenue forecast", "inputSchema": {"type": "object", "properties": {"months": {"type": "integer", "description": "Months to forecast"}}}}
                        ]
                    }
                
                def call_tool(name, arguments):
                    try:
                        if name == "get_customer":
                            customer = MOCK_CUSTOMERS.get(arguments.get("customer_id"))
                            result = customer if customer else {"error": f"Customer not found: {arguments.get('customer_id')}"}
                        elif name == "list_customers":
                            customers = list(MOCK_CUSTOMERS.values())
                            tier = arguments.get("tier")
                            if tier:
                                customers = [c for c in customers if c["tier"] == tier]
                            result = {"customers": customers, "total": len(customers)}
                        elif name == "search_customers":
                            query = arguments.get("query", "").lower()
                            matches = [c for c in MOCK_CUSTOMERS.values() if query in c["name"].lower() or query in c["email"].lower()]
                            result = {"results": matches, "total": len(matches)}
                        elif name == "get_order":
                            order = MOCK_ORDERS.get(arguments.get("order_id"))
                            if order:
                                total = sum(i["quantity"] * i["price"] for i in order["items"])
                                result = {**order, "total": total}
                            else:
                                result = {"error": f"Order not found: {arguments.get('order_id')}"}
                        elif name == "list_orders":
                            orders = list(MOCK_ORDERS.values())
                            if arguments.get("customer_id"):
                                orders = [o for o in orders if o["customer_id"] == arguments["customer_id"]]
                            if arguments.get("status"):
                                orders = [o for o in orders if o["status"] == arguments["status"]]
                            for o in orders:
                                o["total"] = sum(i["quantity"] * i["price"] for i in o["items"])
                            result = {"orders": orders, "total": len(orders)}
                        elif name == "get_analytics":
                            result = {"metrics": MOCK_ANALYTICS, "generated_at": datetime.now().isoformat()}
                        elif name == "get_revenue_forecast":
                            months = arguments.get("months", 3)
                            base = MOCK_ANALYTICS["monthly_revenue"]
                            forecast = []
                            now = datetime.now()
                            for i in range(months):
                                future = now + timedelta(days=30 * (i + 1))
                                projected = base * ((1 + 0.05) ** (i + 1))
                                forecast.append({"month": future.strftime("%Y-%m"), "projected_revenue": round(projected, 2)})
                            result = {"base_revenue": base, "growth_rate": "5%", "forecast": forecast}
                        else:
                            result = {"error": f"Unknown tool: {name}"}
                        return {"content": [{"type": "text", "text": json.dumps(result, indent=2)}]}
                    except Exception as e:
                        return {"content": [{"type": "text", "text": json.dumps({"error": str(e)})}], "isError": True}
                
                def handler(event, context):
                    try:
                        body = event.get('body', '{}')
                        if isinstance(body, str):
                            body = json.loads(body)
                        method = body.get('method', '')
                        params = body.get('params', {})
                        msg_id = body.get('id')
                
                        if method == 'initialize':
                            result = {"protocolVersion": "2024-11-05", "capabilities": {"tools": {}}, "serverInfo": {"name": "agentcore-mcp", "version": "1.0.0"}}
                        elif method == 'tools/list':
                            result = get_tools_list()
                        elif method == 'tools/call':
                            result = call_tool(params.get('name'), params.get('arguments', {}))
                        else:
                            return {"statusCode": 400, "headers": {"Content-Type": "application/json"}, "body": json.dumps({"jsonrpc": "2.0", "id": msg_id, "error": {"code": -32601, "message": f"Unknown method: {method}"}})}
                
                        return {"statusCode": 200, "headers": {"Content-Type": "application/json"}, "body": json.dumps({"jsonrpc": "2.0", "id": msg_id, "result": result})}
                    except Exception as e:
                        return {"statusCode": 500, "headers": {"Content-Type": "application/json"}, "body": json.dumps({"error": str(e)})}
            EOT
          + filename = "index.py"
        }
    }

  # module.gateway[0].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.gateway[0].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.gateway[0].aws_bedrockagentcore_gateway.mcp will be updated in-place
  ~ resource "aws_bedrockagentcore_gateway" "mcp" {
        name                      = "agentcore-mcp-gateway"
        tags                      = {
            "Component" = "mcp-gateway"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (9 unchanged attributes hidden)

      ~ authorizer_configuration {
          ~ custom_jwt_authorizer {
              ~ discovery_url    = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_0Och8G0S2/.well-known/openid-configuration" -> (known after apply)
                # (2 unchanged attributes hidden)
            }
        }
    }

  # module.gateway[0].aws_lambda_function.mcp_server will be updated in-place
  ~ resource "aws_lambda_function" "mcp_server" {
        id                             = "agentcore-mcp-mcp-server"
      ~ last_modified                  = "2026-01-29T09:01:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "9wjINCm9s6tgEE5hasfjP+Vlw8A3yaPHLLdfWz5BVQA=" -> (known after apply)
        tags                           = {
            "Component" = "mcp-gateway"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ui[0].data.archive_file.lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/ui/lambda.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                import json
                import boto3
                import os
                import uuid
                from typing import Any
                
                client = boto3.client('bedrock-agentcore')
                
                # Runtime ARNs from environment
                RUNTIME_ARNS = json.loads(os.environ.get('RUNTIME_ARNS', '{}'))
                
                def handler(event: dict[str, Any], context: Any) -> dict[str, Any]:
                    """Proxy requests to Bedrock AgentCore runtimes."""
                
                    # CORS headers
                    headers = {
                        'Access-Control-Allow-Origin': '*',
                        'Access-Control-Allow-Headers': 'Content-Type,Authorization',
                        'Access-Control-Allow-Methods': 'GET,POST,OPTIONS',
                        'Content-Type': 'application/json'
                    }
                
                    # Handle preflight
                    if event.get('httpMethod') == 'OPTIONS':
                        return {
                            'statusCode': 200,
                            'headers': headers,
                            'body': ''
                        }
                
                    try:
                        # Support both API Gateway v1 (REST) and v2 (HTTP) payload formats
                        path = event.get('rawPath') or event.get('path', '')
                        method = event.get('requestContext', {}).get('http', {}).get('method') or event.get('httpMethod', 'GET')
                        body = json.loads(event.get('body', '{}')) if event.get('body') else {}
                
                        # Build ID-to-ARN mapping (convert name to lowercase-dash ID)
                        def get_agent_id(name):
                            return name.lower().replace(' ', '-')
                
                        AGENT_ID_TO_ARN = {get_agent_id(name): arn for name, arn in RUNTIME_ARNS.items()}
                        AGENT_ID_TO_NAME = {get_agent_id(name): name for name in RUNTIME_ARNS.keys()}
                
                        # GET /agents - List available agents
                        if path == '/agents' and method == 'GET':
                            agents = []
                            for name, arn in RUNTIME_ARNS.items():
                                agents.append({
                                    'id': get_agent_id(name),
                                    'name': name,
                                    'runtime_arn': arn,
                                    'status': 'active'
                                })
                
                            return {
                                'statusCode': 200,
                                'headers': headers,
                                'body': json.dumps({'agents': agents})
                            }
                
                        # POST /invoke - Invoke an agent
                        if path == '/invoke' and method == 'POST':
                            agent_id = body.get('agent_id')
                            input_text = body.get('input', '')
                            # Generate session ID with minimum 33 chars (uuid.hex = 32 chars)
                            session_id = body.get('session_id') or f"s-{uuid.uuid4().hex}"
                
                            # Extract authenticated user from JWT claims (set by API Gateway authorizer)
                            # Falls back to body.user_id or default for unauthenticated requests
                            jwt_claims = event.get('requestContext', {}).get('authorizer', {}).get('jwt', {}).get('claims', {})
                            user_id = jwt_claims.get('sub') or jwt_claims.get('email') or body.get('user_id', 'anonymous-user')
                
                            # Log authenticated user for audit
                            if jwt_claims:
                                print(f"Authenticated request from user: {user_id}")
                
                            if not agent_id or agent_id not in AGENT_ID_TO_ARN:
                                return {
                                    'statusCode': 400,
                                    'headers': headers,
                                    'body': json.dumps({
                                        'error': f'Invalid agent_id: {agent_id}',
                                        'available': list(AGENT_ID_TO_ARN.keys())
                                    })
                                }
                
                            runtime_arn = AGENT_ID_TO_ARN[agent_id]
                
                            # Build payload for AgentCore
                            payload = {
                                'input': input_text,
                                'user_id': user_id,
                                'session_id': session_id,
                                'stream': False
                            }
                
                            # Invoke AgentCore runtime
                            invoke_params = {
                                'agentRuntimeArn': runtime_arn,
                                'runtimeSessionId': session_id,
                                'payload': json.dumps(payload)
                            }
                
                            response = client.invoke_agent_runtime(**invoke_params)
                
                            # Parse non-streaming response
                            response_body = response['response'].read()
                            response_data = json.loads(response_body)
                
                            # Log full response for debugging
                            print(f"AgentCore response: {json.dumps(response_data)}")
                
                            # Extract output from response (structure may vary)
                            output = response_data.get('output', '')
                            if not output and 'text' in response_data:
                                output = response_data['text']
                            if not output and 'content' in response_data:
                                output = response_data['content']
                            if not output:
                                # If still no output, return the whole response for debugging
                                output = json.dumps(response_data)
                
                            result = {
                                'output': output,
                                'session_id': session_id,
                            }
                
                            return {
                                'statusCode': 200,
                                'headers': headers,
                                'body': json.dumps(result)
                            }
                
                        # Default 404
                        return {
                            'statusCode': 404,
                            'headers': headers,
                            'body': json.dumps({'error': 'Not found'})
                        }
                
                    except Exception as e:
                        import traceback
                        error_details = traceback.format_exc()
                        print(f"Error: {error_details}")
                        return {
                            'statusCode': 500,
                            'headers': headers,
                            'body': json.dumps({'error': str(e), 'details': error_details})
                        }
            EOT
          + filename = "index.py"
        }
    }

  # module.ui[0].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.ui[0].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.ui[0].aws_apigatewayv2_authorizer.jwt[0] will be updated in-place
  ~ resource "aws_apigatewayv2_authorizer" "jwt" {
        id                               = "twa4ac"
        name                             = "cognito-jwt"
        # (6 unchanged attributes hidden)

      ~ jwt_configuration {
          ~ issuer   = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_0Och8G0S2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ui[0].aws_cloudfront_distribution.ui will be updated in-place
  ~ resource "aws_cloudfront_distribution" "ui" {
        id                             = "E1N79FYP07LOK"
        tags                           = {
            "Component" = "ui"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (21 unchanged attributes hidden)

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "agent-ui-tf-239388734812.s3-website-us-east-1.amazonaws.com" -> null
          - origin_id                   = "S3-Website" -> null
          - response_completion_timeout = 0 -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_id                   = "S3-Website"
          + response_completion_timeout = (known after apply)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.ui[0].aws_lambda_function.proxy will be updated in-place
  ~ resource "aws_lambda_function" "proxy" {
        id                             = "agent-ui-tf-proxy"
      ~ last_modified                  = "2026-01-29T00:40:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "yPoYBEbkZmjRcMCQtw2ke2zoAj0uFmquUoJpyK3+3dg=" -> (known after apply)
        tags                           = {
            "Component" = "ui"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ui[0].aws_s3_bucket.ui must be replaced
-/+ resource "aws_s3_bucket" "ui" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::agent-ui-tf-239388734812" -> (known after apply)
      ~ bucket                      = "agent-ui-tf-239388734812" # forces replacement -> (known after apply) # forces replacement
      ~ bucket_domain_name          = "agent-ui-tf-239388734812.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_region               = "us-east-1" -> (known after apply)
      ~ bucket_regional_domain_name = "agent-ui-tf-239388734812.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "agent-ui-tf-239388734812" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::agent-ui-tf-239388734812/*"
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Component" = "ui"
            "ManagedBy" = "terraform"
            "Project"   = "iker-agents"
        }
      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "agent-ui-tf-239388734812.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "1d215056988487726f2f10a05f64cf478b43d6b09f3429c204f2aaa605419440" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "index.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.ui[0].aws_s3_bucket_policy.ui must be replaced
-/+ resource "aws_s3_bucket_policy" "ui" {
      ~ bucket = "agent-ui-tf-239388734812" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "agent-ui-tf-239388734812" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::agent-ui-tf-239388734812/*"
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ui[0].aws_s3_bucket_public_access_block.ui must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "ui" {
      ~ bucket                  = "agent-ui-tf-239388734812" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "agent-ui-tf-239388734812" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ui[0].aws_s3_bucket_website_configuration.ui must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "ui" {
      ~ bucket           = "agent-ui-tf-239388734812" # forces replacement -> (known after apply) # forces replacement
      ~ id               = "agent-ui-tf-239388734812" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "agent-ui-tf-239388734812.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 6 to change, 4 to destroy.

Changes to Outputs:
  ~ ui_bucket_name                = "agent-ui-tf-239388734812" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @iker592, Action: `pull_request`*